**Q1. What is a database? Differentiate between SQL and NoSQL databases.**

A `database` is a `structured` collection of data that is `organized` and stored for `easy access`, `management`, and `retrieval.` It allows users to efficiently `store`, `retrieve`, `update`, and `delete` data.

`SQL (Structured Query Language)` and `NoSQL (Not Only SQL)` are two types of database management systems that differ in their `data models`, `query languages`, and `scalability.`

`SQL` databases are based on the `relational data model` and use `tables` with `predefined schemas` to store data. They enforce `strict data consistency` and `integrity` through `ACID (Atomicity, Consistency, Isolation, Durability)` properties. SQL databases use SQL as the query language for retrieving and manipulating data. Examples of SQL databases include MySQL, PostgreSQL, and Oracle.

NoSQL databases, on the other hand, provide a more flexible data model that allows for the storage of unstructured, semi-structured, and structured data. They do not enforce a fixed schema, which makes them more scalable and adaptable to evolving data needs. NoSQL databases use various data models such as key-value, document, columnar, and graph. Query languages in NoSQL databases differ based on the specific database type. Examples of NoSQL databases include MongoDB, Cassandra, and Redis.

**Checking Connection to MySQL Server From Jupyter Notebook**

In [1]:
import mysql.connector as sql

mydb = sql.connect(
    host = "localhost",
    user = "root",
    password = "abbhicse",
    use_pure = True
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000002C6B32CEEC0>

**Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.**

In [2]:
# Need to install some driver and packages for database connection 
!pip3 install ipython-sql
!pip3 install mysqlclient
!pip3 install mysql-connector
!pip3 install mysql-connector-python

Requirement already satisfied: ipython-sql in c:\users\lenovo\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: sqlparse in c:\users\lenovo\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: ipython-genutils in c:\users\lenovo\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython in c:\users\lenovo\anaconda3\lib\site-packages (from ipython-sql) (8.10.0)
Requirement already satisfied: prettytable in c:\users\lenovo\anaconda3\lib\site-packages (from ipython-sql) (3.8.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\lenovo\anaconda3\lib\site-packages (from ipython-sql) (2.0.16)
Requirement already satisfied: six in c:\users\lenovo\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\lenovo\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\lenovo\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: pygments>=2.4.0 in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: matplotlib-inline in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: colorama in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: backcall in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: jedi>=0.16 in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: traitlets>=5 in c:\users\lenovo\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: wcwidth in c:\users\lenovo\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\lenovo\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\lenovo\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\lenovo\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing in c:\users\lenovo\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: mysqlclient in c:\users\lenovo\anaconda3\lib\site-packages (2.1.1)
Requirement already satisfied: mysql-connector in c:\users\lenovo\anaconda3\lib\site-packages (2.2.9)
Requirement already satisfied: mysql-connector-python in c:\users\lenovo\anaconda3\lib\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\lenovo\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)

In [3]:
# Load the SQL module in the notebook
%load_ext sql

In [4]:
# Establish the MySQL server connection to notebook
# MySQL server is installed in my local machine
%sql mysql+mysqldb://root:abbhicse@localhost/my_schema

Now, with the use of `%sql magic`, we can use `SQL` queries `directly` in `Jupyter Notebook.`

`DDL` stands for `Data Definition Language`. It is a `subset` of `SQL (Structured Query Language)` used to define and manage the structure of a database. `DDL` statements are used to `create`, `modify`, and `delete` database objects such as `tables`, `indexes`, and `constraints.`

Here are the explanations of the `DD`L statements you mentioned:

- **CREATE:** The `CREATE` statement is used to `create` a new database object, such as a `table.` It specifies the `name` of the `object`, its `columns`, `data types`, `constraints`, and other properties. For example, to `create` a table named `Customers` with columns for `customer_id`, `name`, and `email` and `phone_no`, you can use the following SQL statement:

In [5]:
%%sql
CREATE TABLE Customers (
    customer_id INT PRIMARY KEY,
    name VARCHAR(50),
    email VARCHAR(100),
    phone_no BIGINT
);

 * mysql+mysqldb://root:***@localhost/my_schema
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO Customers
VALUES (101 , 'abhishek', 'abbhi87@gmail.com', 9455667890),
       (102 , 'kamal', 'kamal88@gmail.com', 9455664490),
       (103 , 'vinay', 'vinay89@gmail.com', 9423664490),
        (104 , 'sukesh', 'sukesh89@gmail.com', 9424564490),
        (105 , 'ajay', 'ajay87@gmail.com', 9425554490),
        (106 , 'riddhi', 'riddhi89@gmail.com', 9489664490);

 * mysql+mysqldb://root:***@localhost/my_schema
6 rows affected.

[]

In [7]:
%%sql
# Show the tables that are available in the database my_schema
SHOW TABLES;

 * mysql+mysqldb://root:***@localhost/my_schema
1 rows affected.

[('customers',)]

In [8]:
%%sql
# Show the structure of the table
DESCRIBE Customers;

 * mysql+mysqldb://root:***@localhost/my_schema
4 rows affected.

[('customer_id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(50)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, ''),
 ('phone_no', 'bigint', 'YES', '', None, '')]

In [9]:
%%sql
# Show the all rows of the table
SELECT * from Customers;

 * mysql+mysqldb://root:***@localhost/my_schema
6 rows affected.

[(101, 'abhishek', 'abbhi87@gmail.com', 9455667890),
 (102, 'kamal', 'kamal88@gmail.com', 9455664490),
 (103, 'vinay', 'vinay89@gmail.com', 9423664490),
 (104, 'sukesh', 'sukesh89@gmail.com', 9424564490),
 (105, 'ajay', 'ajay87@gmail.com', 9425554490),
 (106, 'riddhi', 'riddhi89@gmail.com', 9489664490)]

- **ALTER:** The `ALTER` statement is used to `modify` the structure of an existing database `object.` It allows you to `add`, `modify`, or `delete` `columns`, `constraints`, and other properties of the object. For example, to `add` a new column named `address` to the `Customers` table, you can use the following SQL statement:

In [10]:
%%sql
ALTER TABLE Customers
ADD address VARCHAR(200);

 * mysql+mysqldb://root:***@localhost/my_schema
0 rows affected.

[]

In [11]:
%%sql
# Show the all rows of the table
SELECT * from Customers;

 * mysql+mysqldb://root:***@localhost/my_schema
6 rows affected.

[(101, 'abhishek', 'abbhi87@gmail.com', 9455667890, None),
 (102, 'kamal', 'kamal88@gmail.com', 9455664490, None),
 (103, 'vinay', 'vinay89@gmail.com', 9423664490, None),
 (104, 'sukesh', 'sukesh89@gmail.com', 9424564490, None),
 (105, 'ajay', 'ajay87@gmail.com', 9425554490, None),
 (106, 'riddhi', 'riddhi89@gmail.com', 9489664490, None)]

- **TRUNCATE:** The `TRUNCATE` statement is used to `remove all data from a table`, but keeps the `structure` of the `table intact`. It is `faster` than the `DELETE` statement because it does not generate `individual delete` operations for each row. For example, to `remove all data` from the `Customers` table, you can use the following SQL statement:

In [12]:
%%sql
TRUNCATE TABLE Customers;

 * mysql+mysqldb://root:***@localhost/my_schema
0 rows affected.

[]

In [13]:
%%sql
# Show the all rows of the table
SELECT * from Customers;

 * mysql+mysqldb://root:***@localhost/my_schema
0 rows affected.

[]

- **DROP:** The `DROP` statement is used to `remove` a database object, such as a `table`, from the database. It `permanently deletes` the `object` and its `data.` For example, to `drop` the `Customers` table created above, you can use the following SQL statement:

In [14]:
%%sql
DROP TABLE Customers;

 * mysql+mysqldb://root:***@localhost/my_schema
0 rows affected.

[]

In [15]:
%%sql
SHOW TABLES;

 * mysql+mysqldb://root:***@localhost/my_schema
0 rows affected.

[]

**Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.**

`DML` stands for `Data Manipulation Language.` It is a subset of `SQL` used for performing `operations` on `data` in a database. Here are the explanations and examples of the `INSERT`, `UPDATE`, and `DELETE` statements:

- **INSERT:** The `INSERT` statement is used to `insert new rows` of data into a table. It allows you to specify the values for `each column` or `select them` from `another` table. For example, to `insert` `6` customers into the `Customers` table with  a new name `John Doe` and `email` `johndoe@gmail.com`, you can use the following `SQL` statement:

In [16]:
%%sql
CREATE TABLE Customers (
    customer_id INT PRIMARY KEY,
    name VARCHAR(50),
    email VARCHAR(100),
    age   INT,
    phone_no BIGINT
);

 * mysql+mysqldb://root:***@localhost/my_schema
0 rows affected.

[]

In [17]:
%%sql
INSERT INTO Customers
VALUES (101 , 'abhishek', 'abbhi87@gmail.com', 32, 9455667890),
       (102 , 'kamal', 'kamal88@yahoo.com', 35, 9455664490),
       (103 , 'vinay', 'vinay89@yahoo.com', 37,  9423664490),
        (104 , 'John Doe', 'johndoe@gmail.com', 39, 9424564490),
        (105 , 'ajay', 'ajay87@gmail.com', 42, 9425554490),
        (106 , 'riddhi', 'riddhi89@gmail.com', 31, 9489664490);

 * mysql+mysqldb://root:***@localhost/my_schema
6 rows affected.

[]

In [18]:
%%sql
# Show the all rows of the table
SELECT * from Customers;

 * mysql+mysqldb://root:***@localhost/my_schema
6 rows affected.

[(101, 'abhishek', 'abbhi87@gmail.com', 32, 9455667890),
 (102, 'kamal', 'kamal88@yahoo.com', 35, 9455664490),
 (103, 'vinay', 'vinay89@yahoo.com', 37, 9423664490),
 (104, 'John Doe', 'johndoe@gmail.com', 39, 9424564490),
 (105, 'ajay', 'ajay87@gmail.com', 42, 9425554490),
 (106, 'riddhi', 'riddhi89@gmail.com', 31, 9489664490)]

- **UPDATE:** The `UPDATE` statement is used to `modify existing` data in a table. It allows you to `update one or more columns` with new values based on `specified conditions`. For example, to `update` the `email` of a customer with the name `John Doe` to `johndoe87@gamil.com`, you can use the following SQL statement:

In [19]:
%%sql
UPDATE Customers
SET email = 'johndoe87@gmail.com'
WHERE name = 'John Doe';

 * mysql+mysqldb://root:***@localhost/my_schema
1 rows affected.

[]

In [20]:
%%sql
# Show the all rows of the table
SELECT * from Customers;

 * mysql+mysqldb://root:***@localhost/my_schema
6 rows affected.

[(101, 'abhishek', 'abbhi87@gmail.com', 32, 9455667890),
 (102, 'kamal', 'kamal88@yahoo.com', 35, 9455664490),
 (103, 'vinay', 'vinay89@yahoo.com', 37, 9423664490),
 (104, 'John Doe', 'johndoe87@gmail.com', 39, 9424564490),
 (105, 'ajay', 'ajay87@gmail.com', 42, 9425554490),
 (106, 'riddhi', 'riddhi89@gmail.com', 31, 9489664490)]

**DELETE:** The `DELETE` statement is used to `remove one or more rows` from a table based on `specified` conditions. It allows you to `selectively delete` data from a table. For example, to `delete` all customers with the email domain `@example.com` from the Customers table, you can use the following `SQL` statement:

In [21]:
%%sql
DELETE FROM Customers
WHERE email LIKE '%@yahoo.com';

 * mysql+mysqldb://root:***@localhost/my_schema
2 rows affected.

[]

In [22]:
%%sql
# Show the all rows of the table
SELECT * from Customers;

 * mysql+mysqldb://root:***@localhost/my_schema
4 rows affected.

[(101, 'abhishek', 'abbhi87@gmail.com', 32, 9455667890),
 (104, 'John Doe', 'johndoe87@gmail.com', 39, 9424564490),
 (105, 'ajay', 'ajay87@gmail.com', 42, 9425554490),
 (106, 'riddhi', 'riddhi89@gmail.com', 31, 9489664490)]

**Q4. What is DQL? Explain SELECT with an example.**

`DQL` stands for `Data Query Language`. It is a subset of `SQL (Structured Query Language)` that focuses on `retrieving and manipulating` data from a database.

The `SELECT` statement is used in `DQL` to `retrieve` data from` one or more tables`. It allows you to specify the `columns` you want to `retrieve`, as well as `conditions` to `filter` the results.

Here's an example of using the `SELECT` statement:

In [23]:
%%sql
SELECT name, email
FROM Customers
WHERE name LIKE 'a%'

 * mysql+mysqldb://root:***@localhost/my_schema
2 rows affected.

[('abhishek', 'abbhi87@gmail.com'), ('ajay', 'ajay87@gmail.com')]

This query selects the `name` and `email` columns from the `Customers` table, but only for the rows where the name `starts` with `a`. The `%` symbol is a `wildcard` that matches any characters.

**Q5. Explain Primary Key and Foreign Key.**

**Primary Key:**

A `primary` key is a `column` or a `combination of columns` in a table that `uniquely identifies` `each row` in that table. It enforces the `entity integrity` rule, ensuring that each row in the table is `uniquely identifiable`. Here are some characteristics of a `primary key:`

- A `primary key` must contain `uniqu`e values. No `two rows` can have the `same` primary key value.
- A `primary key` cannot contain `NULL` values. Each row must have a `non-null` value for the `primary key` column(s).
- A `primary key` can be a `single` column or a `combination` of columns.

**Foreign Key:**

A `foreign key` is a `column` or a `combination of columns` in a table that refers to the `primary key` of another table. It establishes a relationship between `two tables` based on the values in the `foreign key` column(s). Here are some characteristics of a `foreign key:`

- A `foreign key` in one table refers to the `primary key` of `another` table, creating a `link` between them.
- It ensures `referential integrity` by enforcing that the values in the `foreign key column(s)` must exist in the `referenced table's primary key` column(s).
- `Multiple rows` in the `referencing` table can have the `same foreign key` value, allowing for `one-to-many` relationships between tables.

**Example:**

Let's consider an example of two tables: `Customers` and `Orders.` The `Customers` table has a `primary key` column called `customer_id`, and the Orders table has a `foreign key` column called `customer_id`, which references the `customer_id` column in the `Customers` table. This relationship indicates that `each order` in the `Orders` table is associated with a `customer` from the `Customers` table.

Here's an example schema for the two tables:

**Customers:**

customer_id (Primary Key) | name        | email
--------------------------|-------------|------------------------
1                         | John Doe    | johndoe@yahoo.com
2                         | Jane Smith  | janesmith@gmail.com

**Orders:**

order_id | customer_id (Foreign Key) | order_date  | total_amount
---------|---------------------------|-------------|-------------
1        | 1                         | 2023-06-01  | 100.00
2        | 2                         | 2023-06-02  | 50.00
3        | 1                         | 2023-06-03  | 75.00

In this example, the `customer_id` column in the `Orders` table is a `foreign key` that `references` the `primary key` `customer_id` in the `Customers` table. This allows us to establish a relationship between `orders` and `customers`. For example, we can `retrieve` orders for a specific `customer` by `joining` the `Customers` and `Orders` tables on the `customer_id` column.

**Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.**

To connect `MySQL` to `Python`, we can use the `mysql.connector module`. First, we need to install it using `pip:`

In [24]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\lenovo\anaconda3\lib\site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\lenovo\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)

Once we have installed the module, you can use the following code to `connect to MySQL` and perform `database` operations:

In [25]:
import mysql.connector as sql

# Establish the connection
cnx = sql.connect(
    host="localhost",
    user="root",
    password="abbhicse",
    database="my_schema",
    use_pure= True
)

# Create a cursor object
cursor = cnx.cursor()

# Execute SQL queries
query = "SELECT * FROM Customers"
cursor.execute(query)

# Fetch the results
results = cursor.fetchall()

# Process the results
for row in results:
    print(row)

# Close the cursor and connection
cursor.close()
cnx.close()

(101, 'abhishek', 'abbhi87@gmail.com', 32, 9455667890)
(104, 'John Doe', 'johndoe87@gmail.com', 39, 9424564490)
(105, 'ajay', 'ajay87@gmail.com', 42, 9425554490)
(106, 'riddhi', 'riddhi89@gmail.com', 31, 9489664490)

**Explanation of the cursor() method:**

The `cursor()` method creates a `cursor object` that allows you to execute `SQL` statements and `fetch` results. The `cursor object` acts as a `handle` for executing `SQL queries` and `fetching data` from the database. It provides methods like `execute()` to execute `SQL` statements, `fetchone()` to fetch a `single row`, and `fetchall()` to fetch `all rows` returned by a query.

**Explanation of the execute() method:**

The `execute()` method is used to `execute SQL` statements or queries. It takes the `SQL` statement as a `parameter` and executes it using the `cursor.` We can pass `parameters` to the `query` using `placeholders (%s)` and provide the `values` as a `tuple` in the `second argument` of the `execute()` method.

In [26]:
import mysql.connector as sql

# Establish the connection
cnx = sql.connect(
    host="localhost",
    user="root",
    password="abbhicse",
    database="my_schema",
    use_pure=True
)

# Create a cursor object
cursor = cnx.cursor()

# Execute INSERT SQL query with placeholders and values
insert_query = "INSERT INTO Customers (customer_id, name, age) VALUES (%s, %s, %s);"
# Create a tuple with the data
data = (110, "John Doe", 25)
# Execute the query with the data
cursor.execute(insert_query, data)
# Commit the transaction
cnx.commit()  

# Execute SELECT SQL query to see the table Customers
select_query = "SELECT * FROM Customers"
cursor.execute(select_query)
print("After Insertion the table Customers will look like:")
# Fetch the results
results = cursor.fetchall()
# Process the results
for row in results:
    print(row)

# Define the UPDATE query with placeholders and values
update_query = "UPDATE Customers SET age = %s WHERE name = %s;"
# Create a tuple with the data
data = (30, "John Doe")
# Execute the query with the data
cursor.execute(update_query, data)
# Commit the transaction
cnx.commit() 

# Execute SELECT SQL query to see the table Customers
select_query = "SELECT * FROM Customers"
cursor.execute(select_query)
print("\t")
print("After Updation the table Customers will look like:")
# Fetch the results
results = cursor.fetchall()
# Process the results
for row in results:
    print(row)
          
# Close the cursor and connection
cursor.close()
cnx.close()

After Insertion the table Customers will look like:
(101, 'abhishek', 'abbhi87@gmail.com', 32, 9455667890)
(104, 'John Doe', 'johndoe87@gmail.com', 39, 9424564490)
(105, 'ajay', 'ajay87@gmail.com', 42, 9425554490)
(106, 'riddhi', 'riddhi89@gmail.com', 31, 9489664490)
(110, 'John Doe', None, 25, None)

After Updation the table Customers will look like:
(101, 'abhishek', 'abbhi87@gmail.com', 32, 9455667890)
(104, 'John Doe', 'johndoe87@gmail.com', 30, 9424564490)
(105, 'ajay', 'ajay87@gmail.com', 42, 9425554490)
(106, 'riddhi', 'riddhi89@gmail.com', 31, 9489664490)
(110, 'John Doe', None, 30, None)

In this example, we first define an `INSERT` query with `placeholders %s` for the values we want to insert into the database. Then we create a `tuple data` with the values `John Doe` and `25`. We pass both the `query` and the `data tuple` as arguments to the `execute()` method. Similarly, we execute an `UPDATE` query with `placeholders %s` and a different set of `values` in the `data tuple.`

Finally, we `commit` the changes using `cnx.commit() `and `close` the cursor and connection as before.

**Q7. Give the order of execution of SQL clauses in an SQL query.**

The order of execution of SQL clauses in an SQL query is as follows:

- `FROM and/or JOIN:` Specifies the table or multiple tables from which to retrieve data.
- `WHERE:` Filters the rows based on specified conditions.
- `GROUP BY:` Groups the rows based on specified columns.
- `HAVING:` Filters the grouped rows based on specified conditions.
- `SELECT:` Retrieves the columns or expressions to be included in the result set.
- `ORDER BY:` Sorts the result set based on specified columns.
- `LIMIT/OFFSET:` Limits the number of rows returned or skips a specified number of rows.

Please note that `not all` clauses are required in every query, and their order may vary depending on the specific query we are writing.

Here is the completed code:
```python
# Order of execution of SQL clauses in an SQL query
query = "SELECT column1, column2 FROM table_name WHERE condition GROUP BY column1 HAVING condition ORDER BY column1 LIMIT number;"

```
The code above represents a template for an SQL query where you can replace `column1`, `column2`, `table_name`, `condition`, and `number` with the appropriate values for your `specific` query.